Table of Contents
 Enum LoadCaseSubType
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load case sub type
public enum LoadCaseSubType
Fields
PermanentPrestress = 2
Permanent - prestress (posttensioned)
PermanentPrestressPretensioned = 15
Permanent - prestress (posttensioned)
PermanentPrestressPrimary = 16
Permanent - prestress primary effect
PermanentPrimaryEffect = 7
Permanent - primary effect
PermanentRheologic = 3
Permanent - Rheologic
PermanentSelfweight = 0
Permanent - self weight
PermanentSelfweightLocal = 17
Permanent - self weight - local
PermanentStandard = 1
Permanent - standard
VariableDynamic = 10
Variable - dynamic
VariablePrimaryEffect = 11
Variable - primary effect
VariableStatic = 9
Variable - static
Fields
 Name |  Description
 PermanentPrestress = 2
Permanent - prestress (posttensioned)
 PermanentPrestressPretensioned = 15
Permanent - prestress (posttensioned)
 PermanentPrestressPrimary = 16
Permanent - prestress primary effect
 PermanentPrimaryEffect = 7
Permanent - primary effect
 PermanentRheologic = 3
Permanent - Rheologic
 PermanentSelfweight = 0
Permanent - self weight
 PermanentSelfweightLocal = 17
Permanent - self weight - local
 PermanentStandard = 1
Permanent - standard
 VariableDynamic = 10
Variable - dynamic
 VariablePrimaryEffect = 11
Variable - primary effect
 VariableStatic = 9
Variable - static
 Edit this page